ticket_search/app/controllers/searches_controller.rb

  def show
    if Team.find_by_name(params[:search][:team]).nil?
      redirect_to teams_path(:search => params[:search])
    else
      date_start = params[:search][:date_start]
      date_end = params[:search][:date_end]
      @team = Team.find_by_name(params[:search][:team])
      @games = []
      @price_min = params[:search][:price_min].to_i
      @price_max = params[:search][:price_max].to_i
      @team.games.each { |game| @games << game if game[:date] > date_start && game[:date] < date_end }
---
SELECT "teams".* FROM "teams" WHERE "teams"."name" = 'Golden State Warriors' LIMIT 1
SELECT "games".* FROM "games" WHERE "games"."team_id" = 1