ticket_search/app/controllers/teams_controller.rb

  def create
    @team = Team.find_by_name(params[:team][:name])
    @@min = params[:min_price]
    @@max = params[:max_price]
    if @team.nil?
      @team = Team.new(params[:team])
      @team.best_game_id = TicketHelper::Tickets.new(@team.name).best_game_id
      @team.save
---
INSERT INTO "games" ("average_price", "created_at", "date", "home", "latitude", "longitude", "opponent", "popularity", "popularity_multiplier", "relative_popularity", "relative_price", "stubhub_id", "team_id", "updated_at", "venue") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "teams" ("arena_image", "away_average_price", "away_price_standard_deviation", "best_game_id", "created_at", "home_average_popularity", "home_average_price", "home_price_standard_deviation", "home_standard_deviation", "name", "section_averages", "section_standard_deviations", "updated_at", "url") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "games" SET "created_at" = '2012-12-10 12:26:42.503465', "updated_at" = '2012-12-10 12:26:42.503465', "relative_popularity" = 56, "relative_price" = 31, "popularity_multiplier" = 1.6028302471598057 WHERE "games"."id" = 57
UPDATE "teams" SET "section_standard_deviations" = '---